"""
# 案例1 求1-100的和
'''
i1 = 1
i2 = 1 + 1
i3 = 1 + 1 + 1
...
i100 = 1 + 1 + ... + 1
sum = i1 + i2 + ... + i100

sum = 1 + 2 + 3 + ... + 100
'''


i = 1

# 用来接收求和的结果，并初始化为0
sum = 0

while i <= 5:
    # i = 1   sum = 0 + 1 + 2 + 3 +4 + +100
    sum += i
    i += 1

print(sum)
"""


'''
# 案例2 输出100以内的所有奇数
i = 0

while i < 101:
    if i % 2 != 0:
        print(i)
    i += 1
'''


# 案例3 打印99乘法表
# 1 * 1 = 1  1 * 2 = 2 2 * 2 = 4

# 定义两个变量，用来当作两个乘数
i = 1


while i <= 9:
    j = 1
    while j <= i:
        print(f'{j} * {i} = {i * j}', end=' ')
        j += 1
    print()
    i += 1



